DavidSungsuKim/Sungsu_Lab/firmware/CanOpenSTM32/source/CO_driver_stm32f207gz.c
/*
 * CAN module object for STM32H7xx FDCAN peripheral IP.
 *
 * This file is a template for other microcontrollers.
 *
 * @file        CO_driver.c
 * @ingroup     CO_driver
 * @author      Janez Paternoster
 * @copyright   2004 - 2020 Janez Paternoster
 *
 * This file is part of CANopenNode, an opensource CANopen Stack.
 * Project home page is <https://github.com/CANopenNode/CANopenNode>.
 * For more information on CANopen see <http://www.can-cia.org/>.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Implementation Author:               Tilen Majerle <tilen@majerle.eu>
 */
#include "301/CO_driver.h"

#if defined (CODES_FOR_STM32F7)
#include "stm32h7xx_hal.h"
#include "stm32h7xx_ll_rcc.h"
#else
#include "stm32f2xx_hal.h"
#include "stm32f2xx_hal_rcc.h"
#endif

/**
 * \brief           Configuration structure for FDCAN
 */
typedef struct {
    uint16_t clk_presc;                         /*!< Clock prescaler. Can be a any even number between `1` and `30`,
                                                        including `1`, indicating no prescaler */
    struct {
        uint16_t clk_presc;                     /*!< Block generator clock prescaler.
                                                        Can be any value between `1` and `512` for nominal
                                                        and any value between `1` and `32` for data */
        uint16_t swj;                           /*!< Number of SWJ Time-Quantas.
                                                        Can be any value between `1` and `128` for nominal
                                                        and any value between `1` and `16` for data */
        uint16_t ts1;                           /*!< Number of TS1 Time-Quantas.
                                                        Can be any value between `2` and `256` for nominal
                                                        and any value between `1` and `32` for data */
        uint16_t ts2;                           /*!< Number of TS2 Time-Quantas.
                                                        Can be any value between `2` and `128` for nominal
                                                        and any value between `1` and `16` for data */
    } br_nominal;
} fdcan_br_cfg_t;

/* Local CAN module object */
static CO_CANmodule_t* CANModule_local = NULL;  /* Local instance of global CAN module */

/* CAN masks for identifiers */
#define CANID_MASK                              0x07FF  /*!< CAN standard ID mask */
#define FLAG_RTR                                0x8000  /*!< RTR flag, part of identifier */

#if defined(USE_OS)
/* Mutex for atomic access */
static osMutexId_t co_mutex;

/* Semaphore for main app thread synchronization */
osSemaphoreId_t co_drv_app_thread_sync_semaphore;

/* Semaphore for periodic thread synchronization */
osSemaphoreId_t co_drv_periodic_thread_sync_semaphore;
#endif /* defined(USE_OS) */

#if defined (CODES_FOR_STM32F7)
/* FDCAN handle object */
FDCAN_HandleTypeDef hfdcan1;
/*
 * Setup default config for 125kHz
 *
 * Settings assume FDCAN input kernel clock is 80 MHz.
 * See \ref fdcan_br_cfg_t for global options
 */
static const fdcan_br_cfg_t
fdcan_br_cfg = {
    .clk_presc = 4,                             /* Decrease input clock to 20 MHz */
    .br_nominal = {                             /* Configure br nominal to 125 kHz */
        .clk_presc = 8,                         /* Set nominal tq time to 2.5 MHz */
        .swj = 1,
        .ts1 = 16,
        .ts2 = 3
    },
};
#endif

/******************************************************************************/
void
CO_CANsetConfigurationMode(void *CANptr) {

#if defined (CODES_FOR_STM32F7)
    /* Put CAN module in configuration mode */
    if (CANptr != NULL) {
        HAL_FDCAN_Stop(CANptr);
    }
#endif
}

/******************************************************************************/
void
CO_CANsetNormalMode(CO_CANmodule_t *CANmodule) {
    /* Put CAN module in normal mode */
#if defined (CODES_FOR_STM32F7)
    if (CANmodule->CANptr != NULL && HAL_FDCAN_Start(CANmodule->CANptr) == HAL_OK) {
        CANmodule->CANnormal = true;
    }
#endif
}

/******************************************************************************/
CO_ReturnError_t
CO_CANmodule_init(
        CO_CANmodule_t         *CANmodule,
        void                   *CANptr,
        CO_CANrx_t              rxArray[],
        uint16_t                rxSize,
        CO_CANtx_t              txArray[],
        uint16_t                txSize,
        uint16_t                CANbitRate)
{
#if defined (CODES_FOR_STM32F7)
    FDCAN_ClkCalUnitTypeDef fdcan_clk = {0};
#endif

    /* verify arguments */
    if (CANmodule == NULL || rxArray == NULL || txArray == NULL) {
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

    /*
     * Application must set CAN pointer to FDCAN handle.
     *
     * Only FDCAN1 is supported in current revision.
     */
#if defined (CODES_FOR_STM32F7)
    if (CANptr != &hfdcan1) {
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }
#endif

    /* Hold CANModule variable */
    CANModule_local = CANmodule;

    /* Configure object variables */
    CANmodule->rxArray = rxArray;
    CANmodule->rxSize = rxSize;
    CANmodule->txArray = txArray;
    CANmodule->txSize = txSize;
    CANmodule->CANerrorStatus = 0;
    CANmodule->CANnormal = false;
    CANmodule->useCANrxFilters = false;             /* Do not use HW filters */
    CANmodule->bufferInhibitFlag = false;
    CANmodule->firstCANtxMessage = true;
    CANmodule->CANtxCount = 0U;
    CANmodule->errOld = 0U;

    /* Reset all variables */
    for (uint16_t i = 0U; i < rxSize; i++) {
        rxArray[i].ident = 0U;
        rxArray[i].mask = 0xFFFFU;
        rxArray[i].object = NULL;
        rxArray[i].CANrx_callback = NULL;
    }
    for (uint16_t i = 0U; i < txSize; i++) {
        txArray[i].bufferFull = false;
    }

#if defined (CODES_FOR_STM32F7)
    /***************************************/
    /* STM32H7 FDCAN related configuration */
    /***************************************/

    /* Set instance at the beginning */
    hfdcan1.Instance = FDCAN1;
    HAL_FDCAN_Stop(&hfdcan1);
    HAL_FDCAN_DeInit(&hfdcan1);

    /* Set FDCAN parameters */
    hfdcan1.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
    hfdcan1.Init.Mode = FDCAN_MODE_NORMAL;
    hfdcan1.Init.AutoRetransmission = ENABLE;
    hfdcan1.Init.TransmitPause = ENABLE;
    hfdcan1.Init.ProtocolException = DISABLE;

    /* Setup nominal bit timing */
    hfdcan1.Init.NominalPrescaler = fdcan_br_cfg.br_nominal.clk_presc;
    hfdcan1.Init.NominalSyncJumpWidth = fdcan_br_cfg.br_nominal.swj;
    hfdcan1.Init.NominalTimeSeg1 = fdcan_br_cfg.br_nominal.ts1;
    hfdcan1.Init.NominalTimeSeg2 = fdcan_br_cfg.br_nominal.ts2;

