DavidSungsuKim/Sungsu_Lab/firmware/CanOpenSTM32/source/CO_driver_stm32f207gz.c
    /*
     * Setup data bit timing.
     *
     * Used only if FD and BRS modes are globally enabled,
     * which is not the case for CANopen
     */
    hfdcan1.Init.DataPrescaler = hfdcan1.Init.NominalPrescaler;
    hfdcan1.Init.DataSyncJumpWidth = hfdcan1.Init.NominalSyncJumpWidth;
    hfdcan1.Init.DataTimeSeg1 = hfdcan1.Init.NominalTimeSeg1;
    hfdcan1.Init.DataTimeSeg2 = hfdcan1.Init.NominalTimeSeg2;

    /* Number of used filters */
    hfdcan1.Init.StdFiltersNbr = 0;
    hfdcan1.Init.ExtFiltersNbr = 0;

    /* Message part */
    hfdcan1.Init.MessageRAMOffset = 0;
    hfdcan1.Init.RxFifo0ElmtsNbr = 64;          /* FIFO 0 for standard message ID */
    hfdcan1.Init.RxFifo0ElmtSize = FDCAN_DATA_BYTES_8;
    hfdcan1.Init.RxBuffersNbr = 0;
    hfdcan1.Init.RxBufferSize = FDCAN_DATA_BYTES_64;
    hfdcan1.Init.TxEventsNbr = 0;
    hfdcan1.Init.TxBuffersNbr = 0;              /* Do not use TX buffers */
    hfdcan1.Init.TxFifoQueueElmtsNbr = 32;      /* Max number of TX FIFO size */
    hfdcan1.Init.TxElmtSize = FDCAN_DATA_BYTES_64;   /* Max number of bytes per message in TX FIFO */
    hfdcan1.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
    if (HAL_FDCAN_Init(&hfdcan1) != HAL_OK) {
        /* What should we return here? */
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

    /* Setup prescaler block config for FDCAN input module */
    switch (fdcan_br_cfg.clk_presc) {
        case 0:
        case 1: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV1; break;
        case 2: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV2; break;
        case 4: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV4; break;
        case 6: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV6; break;
        case 8: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV8; break;
        case 10: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV10; break;
        case 12: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV12; break;
        case 14: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV14; break;
        case 16: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV16; break;
        case 18: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV18; break;
        case 20: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV20; break;
        case 22: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV22; break;
        case 24: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV24; break;
        case 26: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV26; break;
        case 28: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV28; break;
        case 30: fdcan_clk.ClockDivider = FDCAN_CLOCK_DIV30; break;
        default: return CO_ERROR_ILLEGAL_ARGUMENT;
    }
    fdcan_clk.ClockCalibration = FDCAN_CLOCK_CALIBRATION_DISABLE;
    if (HAL_FDCAN_ConfigClockCalibration(&hfdcan1, &fdcan_clk) != HAL_OK) {
        HAL_FDCAN_DeInit(&hfdcan1);
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

    /*
     * Configure global filter that is used as last check if message did not pass any of other filters:
     *
     * We do not rely on hardware filters in this example
     * and are performing software filters instead
     *
     * Accept non-matching standard ID messages
     * Reject non-matching extended ID messages
     */
    if (HAL_FDCAN_ConfigGlobalFilter(&hfdcan1,
            FDCAN_ACCEPT_IN_RX_FIFO0, FDCAN_REJECT,
            FDCAN_FILTER_REMOTE, FDCAN_FILTER_REMOTE) != HAL_OK) {
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

    /* Enable notifications */
    if (HAL_FDCAN_ActivateNotification(&hfdcan1,
            0
            | FDCAN_IT_RX_FIFO0_NEW_MESSAGE | FDCAN_IT_RX_FIFO1_NEW_MESSAGE
            | FDCAN_IT_TX_COMPLETE | FDCAN_IT_TX_FIFO_EMPTY
            | FDCAN_IT_BUS_OFF
            | FDCAN_IT_ARB_PROTOCOL_ERROR | FDCAN_IT_DATA_PROTOCOL_ERROR
            | FDCAN_IT_ERROR_PASSIVE | FDCAN_IT_ERROR_WARNING, 0xFFFFFFFF) != HAL_OK) {
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

#endif
    return CO_ERROR_NO;
}

#if defined(USE_OS)

/**
 * \brief           Create all OS objects for CANopen
 * \return          `1` on success, `0` otherwise
 */
uint8_t
co_drv_create_os_objects(void) {
    /* Create new mutex for OS context */
    if (co_mutex == NULL) {
        const osMutexAttr_t attr = {
            .attr_bits = osMutexRecursive,
            .name = "co"
        };
        co_mutex = osMutexNew(&attr);
    }

    /* Semaphore for main app thread synchronization */
    if (co_drv_app_thread_sync_semaphore == NULL) {
        const osSemaphoreAttr_t attr = {
                .name = "co_app_thread_sync"
        };
        co_drv_app_thread_sync_semaphore = osSemaphoreNew(1, 1, &attr);
    }

    /* Semaphore for periodic thread synchronization */
    if (co_drv_periodic_thread_sync_semaphore == NULL) {
        const osSemaphoreAttr_t attr = {
                .name = "co_periodic_thread_sync"
        };
        co_drv_periodic_thread_sync_semaphore = osSemaphoreNew(1, 1, &attr);
    }

    return 1;
}

/**
 * \brief           Lock mutex or wait to be available
 * \return          `1` on success, `0` otherwise
 */
uint8_t
co_drv_mutex_lock(void) {
    return osMutexAcquire(co_mutex, osWaitForever) == osOK;
}

/**
 * \brief           Release previously locked mutex
 * \return          `1` on success, `0` otherwise
 */
uint8_t
co_drv_mutex_unlock(void) {
    return osMutexRelease(co_mutex) == osOK;
}

#endif /* defined(USE_OS) */

/******************************************************************************/
void
CO_CANmodule_disable(CO_CANmodule_t *CANmodule) {

#if defined (CODES_FOR_STM32F7)
    if (CANmodule != NULL && CANmodule->CANptr != NULL) {
        HAL_FDCAN_Stop(CANmodule->CANptr);
    }
#endif
}

/******************************************************************************/
CO_ReturnError_t
CO_CANrxBufferInit(
        CO_CANmodule_t         *CANmodule,
        uint16_t                index,
        uint16_t                ident,
        uint16_t                mask,
        bool_t                  rtr,
        void                   *object,
        void                  (*CANrx_callback)(void *object, void *message))
{
    CO_ReturnError_t ret = CO_ERROR_NO;

    if (CANmodule != NULL && object != NULL
            && CANrx_callback != NULL && index < CANmodule->rxSize) {
        CO_CANrx_t *buffer = &CANmodule->rxArray[index];

        /* Configure object variables */
        buffer->object = object;
        buffer->CANrx_callback = CANrx_callback;

