DavidSungsuKim/Sungsu_Lab/firmware/CanOpenSTM32/source/CO_driver_stm32f207gz.c
    if (fdcanHandle->Instance == FDCAN1) {
        /*
         * Use PLL1Q output for FDCAN clock
         *
         * System clock must output 80 MHz at PLL1Q output
         */
        LL_RCC_SetFDCANClockSource(LL_RCC_FDCAN_CLKSOURCE_PLL1Q);

        /* Peripheral clock enable */
        __HAL_RCC_FDCAN_CLK_ENABLE();
        __HAL_RCC_GPIOH_CLK_ENABLE();

        /*
         * FDCAN1 GPIO Configuration
         *
         * PH13     ------> FDCAN1_TX
         * PH14     ------> FDCAN1_RX
         */
        GPIO_InitStruct.Pin = GPIO_PIN_14 | GPIO_PIN_13;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        GPIO_InitStruct.Alternate = GPIO_AF9_FDCAN1;
        HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

        /* FDCAN1 interrupt Init */
        HAL_NVIC_SetPriority(FDCAN1_IT0_IRQn, 6, 0);
        HAL_NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
        HAL_NVIC_SetPriority(FDCAN1_IT1_IRQn, 6, 0);
        HAL_NVIC_EnableIRQ(FDCAN1_IT1_IRQn);
    }
}

/**
 * \brief           Low-level microcontroller support deinit callback
 * \param[in]       fdcanHandle: FDCAN handle instance
 */
void
HAL_FDCAN_MspDeInit(FDCAN_HandleTypeDef* fdcanHandle) {
    if (fdcanHandle->Instance == FDCAN1) {
        /* Peripheral clock disable */
        __HAL_RCC_FDCAN_CLK_DISABLE();

        /*
         * FDCAN1 GPIO Configuration
         *
         * PH13     ------> FDCAN1_TX
         * PH14     ------> FDCAN1_RX
         */
        HAL_GPIO_DeInit(GPIOH, GPIO_PIN_13 | GPIO_PIN_14);

        /* FDCAN1 interrupt Deinit */
        HAL_NVIC_DisableIRQ(FDCAN1_IT0_IRQn);
        HAL_NVIC_DisableIRQ(FDCAN1_IT1_IRQn);
    }
}

/**
 * \brief           This function handles FDCAN1 interrupt 0
 */
void
FDCAN1_IT0_IRQHandler(void) {
    HAL_FDCAN_IRQHandler(&hfdcan1);

    /* Wake-up application thread */
    CO_WAKEUP_APP_THREAD();
}

/**
 * \brief           This function handles FDCAN1 interrupt 1
 */
void
FDCAN1_IT1_IRQHandler(void) {
    HAL_FDCAN_IRQHandler(&hfdcan1);

    /* Wake-up application thread */
    CO_WAKEUP_APP_THREAD();
}

#endif
